app/models/shortened_url.rb

    def self.user_and_long_to_short(user, long_url)
        ShortenedUrl.create!(
            user_id: user.id,
            long_url: long_url,
            short_url: ShortenedUrl.random_code
        )
---
INSERT INTO "shortened_urls" ("user_id", "short_url", "long_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["short_url", "jYRLz8Cbk5Yk1bbNImlvPg"], ["long_url", "www.yahoo.com"], ["created_at", "2021-10-20 22:22:15.030802"], ["updated_at", "2021-10-20 22:22:15.030802"]]

    def self.random_code
       loop do
           random_code = SecureRandom.urlsafe_base64(16)
           return random_code unless self.exists?(short_url: random_code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "jYRLz8Cbk5Yk1bbNImlvPg"], ["LIMIT", 1]]