app/models/visit.rb

INSERT INTO "visits" ("short_url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["short_url_id", 3], ["user_id", 1], ["created_at", "2021-10-20 22:22:44.858227"], ["updated_at", "2021-10-20 22:22:44.858227"]]
---
    def self.record_visit!(user, shortened_url)
        Visit.create!(
            user_id: user.id,
            short_url_id: shortened_url.id
        )